[Killed] BlockStatement
projects/mutation-tests-example/src/cnh.ts:1:45
-export function podeTirarCnh(idade: number) {
-    return idade >= 18;
-}
+export function podeTirarCnh(idade: number) {}
killedBy: Deve retornar false para pessoa com menos de 18 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
projects/mutation-tests-example/src/cnh.ts:2:12
 export function podeTirarCnh(idade: number) {
-    return idade >= 18;
+    return idade < 18;
 }
killedBy: Deve retornar false para pessoa com menos de 18 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
projects/mutation-tests-example/src/cnh.ts:2:12
 export function podeTirarCnh(idade: number) {
-    return idade >= 18;
+    return false;
 }
killedBy: Deve retornar true para pessoa com 18 anos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
